Tekla.Structures.Analysis.AnalysisConnectivity
The AnalysisConnectivity class contains information related to analysis connectivities.

Tekla.Structures.Analysis.AnalysisConnectivity.NUMBER_OF_DOF
The number of degrees of freedom of the analysis connectivity.

Tekla.Structures.Analysis.AnalysisConnectivity._Connectivity
The connectivity types of the analysis connectivity.

Tekla.Structures.Analysis.AnalysisConnectivity._Spring
The spring values of the analysis connectivity.

Tekla.Structures.Analysis.AnalysisConnectivity.Spring
The spring values of the analysis connectivity.

Tekla.Structures.Analysis.AnalysisConnectivity.Connectivity
The connectivity type of the analysis connectivity.